In [2]:
import os

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
cars_data=pd.read_csv('./Desktop/Toyota.csv',index_col=0)

In Python, there are two ways to create copies
 * Shallow copy :
 - It only creates a new variable that shares the reference of the original object
 - Any changes made to a copy of object will be reflected in the original object as well
 * Deep copy: 
 - In case of deep copy, a copy of object is copied in other object with no 
   reference to the original
 - Any changes made to a copy of object will not be reflected in the original object

In [6]:
samp=cars_data.copy(deep=False) #Shallow Copying

In [7]:
cars_data1=cars_data.copy(deep=True) #Deep copying

ATTRIBUTES OF THE DATA

In [8]:

cars_data1.columns #To display the columns the table

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

In [9]:
cars_data1.index # To display the index (rows)

Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
       ...
       1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
      dtype='int64', length=1436)

In [10]:
cars_data1.size #shape(m*n)

14360

In [11]:
cars_data1.shape

(1436, 10)

In [12]:
cars_data1.ndim

2

In [13]:
cars_data1.memory_usage() # to gives the memory usage

Index        11488
Price        11488
Age          11488
KM           11488
FuelType     11488
HP           11488
MetColor     11488
Automatic    11488
CC           11488
Doors        11488
Weight       11488
dtype: int64

INDEXING AND SELECTING
- Python slicing operator ‘[ ]’ and attribute/ dot operator ‘. ’  are used 
   for indexing
 - Provides quick and easy access to pandas data structures

In [15]:
cars_data1.head(2)

   Price   Age     KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel  90       1.0          0  2000      3    1165

In [16]:
cars_data1.tail(3)

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

-  To access a scalar value, the fastest way is to use the 'at' and 'iat' methods
 - 'at' provides label-based scalar lookups
 - 'iat' provides integer-based lookups

In [18]:
cars_data1.at[0,'Doors'] #Gives the given value in that particular row

'three'

In [19]:
cars_data1.iat[7,5]

1.0

To access a group of rows and columns by label(s) .loc[ ] can be used

In [21]:
cars_data1.loc[:,'Doors'] # To display and slice a particular row or column

0       three
1           3
2           3
3           3
4           3
        ...
1431        3
1432        3
1433        3
1434        3
1435        5
Name: Doors, Length: 1436, dtype: object

DATATYPES
- The way information gets stored in a dataframe or a python object affects
      the analysis and outputs of calculations
    - There are two main types of data : numeric and character types
    - Numeric data types includes integers and floats
    - For example: integer – 10, float – 10.53    
    - Strings are known as objects in pandas which can store values that contain
    - numbers and / or characters
    - For example: ‘category1’

In [23]:
cars_data1.dtypes  # Displays the datatypes of each column

Price          int64
Age          float64
KM            object
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

In [24]:
cars_data1.dtypes.value_counts() #counts the distinct datatype numbers in the columns

int64      4
object     4
float64    2
Name: count, dtype: int64

In [25]:
cars_data1.select_dtypes(exclude=[object,int])

       Age  MetColor
0     23.0       1.0
1     23.0       1.0
2     24.0       NaN
3     26.0       0.0
4     30.0       0.0
...    ...       ...
1431   NaN       1.0
1432  72.0       0.0
1433   NaN       0.0
1434  70.0       1.0
1435  76.0       0.0

[1436 rows x 2 columns]

In [26]:
cars_data1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 155.7+ KB

Unique elements of columns

""" unique() is used to find the unique elements of a column """

In [57]:
print(np.unique(cars_data1['KM']))

['1' '10000' '100123' ... '99865' '99971' '??']

In [59]:
print(np.unique(cars_data1['Doors']))

['2' '3' '4' '5' 'five' 'four' 'three']

In [63]:
print(np.unique(cars_data1['MetColor']))

[ 0.  1. nan]

Importing data (replacing special chars with nan values)

"""
    - We need to know how missing values are represented in the dataset
      in order to make reasonable decisions 
    - The missing values exist in the form of ‘nan’, '??', '????'
    - Python, by default replace blank values with ‘nan’
    - Now, importing the data considering other forms of missing values in a dataframe

In [74]:
cars_data=pd.read_csv('./Desktop/Toyota.csv',index_col=0,na_values=['??','????'])

In [76]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

Converting variable’s data types

""" astype() method is used to explicitly convert data types from one to another"""

In [83]:
cars_data['MetColor']=cars_data['MetColor'].astype('object')

In [85]:
cars_data['Automatic']=cars_data['Automatic'].astype('object')

In [87]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(3), object(4)
memory usage: 123.4+ KB

Cleaning column ‘Doors’

In [90]:
print(np.unique(cars_data['Doors']))

['2' '3' '4' '5' 'five' 'four' 'three']

 replace() is used to replace a value with the desired value 
    Syntax: DataFrame.replace([to_replace, value, …])

In [95]:
cars_data1['Doors'].replace('three',3,inplace=True)
cars_data1['Doors'].replace('four',4,inplace=True)
cars_data1['Doors'].replace('five',5,inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_29896\1707140326.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cars_data1['Doors'].replace('three',3,inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_29896\1707140326.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cars_data1['Doors'].replace('four',4,inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_29896\1707140326.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cars_data1['Doors'].replace('five',5,inplace=True)

In [97]:
cars_data1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

To check the frequencies of unique cateogories in a variable

In [100]:
cars_data['Doors'].where(cars_data['Doors']!='three',3,inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_29896\1909214025.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cars_data['Doors'].where(cars_data['Doors']!='three',3,inplace=True)

In [104]:
cars_data1['Doors']=cars_data1['Doors'].astype('object')
cars_data1['Doors'].value_counts()

Doors
5    673
3    621
4    137
2      2
3      1
4      1
5      1
Name: count, dtype: int64

In [106]:
# To detect missing values
# =============================================================================
# To check the count of missing values present in each column Dataframe.isnull.sum() is used

In [108]:
cars_data1.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

Cross tables & Correlation

In [111]:
cars_data2=cars_data.copy()

 pandas.crosstab()
    - To compute a simple cross-tabulation of one, two (or more) factors
    - By default computes a frequency table of the factors

In [119]:
#One way
pd.crosstab(index=cars_data2['FuelType'],columns='count',dropna=True)

col_0     count
FuelType
CNG          15
Diesel      144
Petrol     1177

In [123]:
#Two way
pd.crosstab(index=cars_data2['FuelType'],columns=cars_data2['Automatic'],dropna=True) #Dropna to avoid the NAN values

Automatic     0   1
FuelType
CNG          15   0
Diesel      144   0
Petrol     1104  73

Two-way table with proportion / Joint probability

"""
Joint probability is the likelihood of two independent events happening at the same time

In [128]:
pd.crosstab(index=cars_data2['Automatic'],columns=cars_data2['FuelType'],dropna=True,normalize=True)

FuelType        CNG    Diesel    Petrol
Automatic
0          0.011228  0.107784  0.826347
1          0.000000  0.000000  0.054641

Two-way table - Marginal probability

"""
Marginal probability is the probability of the occurrence of the single event

In [131]:
pd.crosstab(index=cars_data2['Automatic'],columns=cars_data2['FuelType'],dropna=True,normalize=True,margins=True)

FuelType        CNG    Diesel    Petrol       All
Automatic
0          0.011228  0.107784  0.826347  0.945359
1          0.000000  0.000000  0.054641  0.054641
All        0.011228  0.107784  0.880988  1.000000


"""
Conditional probability is the probability of an event ( A ), given that 
another event ( B ) has already occurred

In [136]:
pd.crosstab(index=cars_data2['Automatic'],columns=cars_data2['FuelType'],dropna=True,normalize='index',margins=True)

FuelType        CNG    Diesel    Petrol
Automatic
0          0.011876  0.114014  0.874109
1          0.000000  0.000000  1.000000
All        0.011228  0.107784  0.880988

Two-way table - Conditional probability => Column sum =1

In [139]:
pd.crosstab(index=cars_data2['Automatic'],columns=cars_data2['FuelType'],dropna=True,normalize='columns',margins=True)

FuelType   CNG  Diesel    Petrol       All
Automatic
0          1.0     1.0  0.937978  0.945359
1          0.0     0.0  0.062022  0.054641

Correlation    

Correlation: the strength of association between two variables 

Excluding the categorical variables to find the correlation

In [148]:
numerical_data=cars_data2.select_dtypes(exclude=[object])
print(numerical_data.shape)

(1436, 6)

In [150]:
corr_matrix=numerical_data.corr()
print(corr_matrix)

           Price       Age        KM        HP        CC    Weight
Price   1.000000 -0.878407 -0.574720  0.309902  0.165067  0.581198
Age    -0.878407  1.000000  0.512735 -0.157904 -0.120706 -0.464299
KM     -0.574720  0.512735  1.000000 -0.335285  0.299993 -0.026271
HP      0.309902 -0.157904 -0.335285  1.000000  0.053758  0.086737
CC      0.165067 -0.120706  0.299993  0.053758  1.000000  0.651450
Weight  0.581198 -0.464299 -0.026271  0.086737  0.651450  1.000000

In [152]:
print(round(corr_matrix,2))

        Price   Age    KM    HP    CC  Weight
Price    1.00 -0.88 -0.57  0.31  0.17    0.58
Age     -0.88  1.00  0.51 -0.16 -0.12   -0.46
KM      -0.57  0.51  1.00 -0.34  0.30   -0.03
HP       0.31 -0.16 -0.34  1.00  0.05    0.09
CC       0.17 -0.12  0.30  0.05  1.00    0.65
Weight   0.58 -0.46 -0.03  0.09  0.65    1.00

\
 Identifying missing values

"""
 - In Pandas dataframes, missing data is represented by NaN
  (an acronym for Not a Number)
 - To check null values in Pandas dataframes, isnull() and isna() are used
 - These functions returns a dataframe of Boolean values which are True for NaN values
"""



 Imputing missing values

""" Two ways of approach
	 - Fill the missing values by mean / median, in case of numerical variable
	 - Fill the missing values with the class which has maximum count, in case of
       categorical variable

 Look at the description to know whether numerical variables should be 
 imputed with mean or median
"""
    DataFrame.describe() - generates descriptive statistics that summarize the 
    central tendency, dispersion and shape of a dataset’s distribution, excluding NaN values

In [158]:
cars_data1.describe()

,Price,Age,KM,HP,MetColor,Automatic,CC,Weight
count,1436.000000,1336.000000,1421.000000,1430.000000,1286.000000,1436.000000,1436.000000,1436.00000
mean,10730.824513,55.672156,68647.239972,101.478322,0.674961,0.055710,1566.827994,1072.45961
std,3626.964585,18.589804,37333.023589,14.768255,0.468572,0.229441,187.182436,52.64112
min,4350.000000,1.000000,1.000000,69.000000,0.000000,0.000000,1300.000000,1000.00000
25%,8450.000000,43.000000,43210.000000,90.000000,0.000000,0.000000,1400.000000,1040.00000
50%,9900.000000,60.000000,63634.000000,110.000000,1.000000,0.000000,1600.000000,1070.00000
75%,11950.000000,70.000000,87000.000000,110.000000,1.000000,0.000000,1600.000000,1085.00000
max,32500.000000,80.000000,243000.000000,192.000000,1.000000,1.000000,2000.000000,1615.00000

In [164]:
 cars_data2.describe(include='O')
cars_data2.describe(include="all")

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
count,1436.000000,1336.000000,1421.000000,1336,1430.000000,1286.0,1436.0,1436.000000,1436,1436.00000
unique,NaN,NaN,NaN,3,NaN,2.0,2.0,NaN,7,NaN
top,NaN,NaN,NaN,Petrol,NaN,1.0,0.0,NaN,5,NaN
freq,NaN,NaN,NaN,1177,NaN,868.0,1356.0,NaN,673,NaN
mean,10730.824513,55.672156,68647.239972,NaN,101.478322,NaN,NaN,1566.827994,NaN,1072.45961
std,3626.964585,18.589804,37333.023589,NaN,14.768255,NaN,NaN,187.182436,NaN,52.64112
min,4350.000000,1.000000,1.000000,NaN,69.000000,NaN,NaN,1300.000000,NaN,1000.00000
25%,8450.000000,43.000000,43210.000000,NaN,90.000000,NaN,NaN,1400.000000,NaN,1040.00000
50%,9900.000000,60.000000,63634.000000,NaN,110.000000,NaN,NaN,1600.000000,NaN,1070.00000
75%,11950.000000,70.000000,87000.000000,NaN,110.000000,NaN,NaN,1600.000000,NaN,1085.00000
max,32500.000000,80.000000,243000.000000,NaN,192.000000,NaN,NaN,2000.000000,NaN,1615.00000

In [166]:
cars_data2['Age'].mean()

55.67215568862275

In [168]:
cars_data2['Age'].median()

60.0

In [ ]:
cars_data2['Age'].fillna(cars_data2['Age']